blog/get-the-china-mobile-modem-super-password.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>获取移动光猫超级密码</title>
<!-- 2022-06-13 Mon 19:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">获取移动光猫超级密码</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 移动光猫通用用户及密码</a></li>
<li><a href="#sec-2">2. 破解步骤</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 移动光猫通用用户及密码</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
CMCCAdmin
aDm8H%MdA
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 破解步骤</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>查看光猫背面用户名密码，登录到后台web管理页面。
</li>
<li>开启telnet。在重启开关/恢复默认设置那个页面，F12打开审查元素，搜索TR_Telnet,删除掉display: none，即可看到页面显示，勾选启用Telnet即可。
</li>
<li>打开terminal工具，输入telnet 192.168.1.1回车，输入密码为上面通用账号密码。
</li>
<li>进去系统之后，切换到root用户，查找db_backup_cfg.xml文件。
</li>
</ol>
<pre class="example">
~ $ su
Password:
/ # find / -name 'db_backup_cfg.xml'
/userconfig/cfg/db_backup_cfg.xml
</pre>
<ol class="org-ol">
<li>在光猫上启动一个tftp服务。
</li>
</ol>
<pre class="example">
udpsvd -vE 0 69 tftpd -c /
</pre>

<ol class="org-ol">
<li>在terminal上下载文件。
</li>
</ol>
<pre class="example">
➜ tftp -e connect 192.168.1.1 69
usage: tftp [-e] host-name [port]
tftp&gt; connect 192.168.1.1 69
tftp&gt; get /userconfig/cfg/db_backup_cfg.xml
Received 503436 bytes in 0.3 seconds
tftp&gt;
</pre>

<ol class="org-ol">
<li>接受完毕后，将如下脚本保存到和db_backup_cfg.xml目录相同的decode.py文件里。
</li>
</ol>

<pre class="example">
from Crypto.Cipher import AES
from binascii import a2b_hex
KEY = b'\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00'
def decrypt(text):
    cryptor = AES.new(KEY, AES.MODE_ECB)
    plain_text = cryptor.decrypt(a2b_hex(text))
    return plain_text
cfg_file = open("db_backup_cfg.xml", "rb")
dec_file = open("db_backup_cfg.decode.xml", "w")
file_header = cfg_file.read(60)
while 1:
    trunk_info = cfg_file.read(12)
    trunk_data = cfg_file.read(65536)
    trunk_real_size = int.from_bytes(trunk_info[0:4], byteorder='big', signed=False)
    trunk_size = int.from_bytes(trunk_info[4:8], byteorder='big', signed=False)
    next_trunk = int.from_bytes(trunk_info[8:12], byteorder='big', signed=False)
    print(trunk_real_size, trunk_size, next_trunk)
    dec_file.write(decrypt(trunk_data.hex()).decode(encoding="utf-8"))
    if next_trunk==0:
        break
</pre>

<ol class="org-ol">
<li>解密
</li>
</ol>
<pre class="example">
➜ python decode.py
</pre>
<p>
若模块没有安装，可以尝试如下安装
</p>
<pre class="example">
pip install binascii
pip install pycrypto
</pre>

<p>
以上除光猫内操作之外，所有操作均为在macOS环境下操作。
</p>

<p>
参考链接：
</p>
<ul class="org-ul">
<li><a href="https://www.52pojie.cn/thread-1577267-1-1.html">https://www.52pojie.cn/thread-1577267-1-1.html</a>
</li>
<li><a href="https://www.right.com.cn/forum/thread-826399-1-1.html">https://www.right.com.cn/forum/thread-826399-1-1.html</a>
</li>
<li><a href="https://blog.csdn.net/qq_40709699/article/details/118657782">https://blog.csdn.net/qq_40709699/article/details/118657782</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>